Show / Hide Table of Contents
Class Region2D
Represents a region in two-dimensional space included outline (border) and openings.
Inheritance
System.Object
OpenObject
Region2D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry2D.Region2D,CI.Geometry2D")]
public class Region2D : OpenObject
Constructors
Improve this Doc   View Source
Region2D()
Constructor
Declaration
public Region2D()
Properties
Improve this Doc   View Source
Openings
Gets or sets the list of openings in the Region2D.
Declaration
public List<PolyLine2D> Openings { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PolyLine2D>
Improve this Doc   View Source
Outline
Gets or sets the outline curve of Region2D.
Declaration
public PolyLine2D Outline { get; set; }
Property Value
 Type |  Description
 PolyLine2D
 Improve this Doc
 View Source